# die roller program

import random

die_art = {
    1: ("⬜️ ⬜️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬜️ ⬛️ ⬜️ ⬜️" ,
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️"),

    2: ("⬜️ ⬜️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬛️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️" ,
       "⬜️ ⬜️ ⬜️ ⬛️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️"),

    3: ("⬜️ ⬜️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬛️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬜️ ⬛️ ⬜️ ⬜️" ,
       "⬜️ ⬜️ ⬜️ ⬛️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️"),

    4: ("⬜️ ⬜️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬛️ ⬜️ ⬛️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️" ,
       "⬜️ ⬛️ ⬜️ ⬛️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️"),

    5: ("⬜️ ⬜️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬛️ ⬜️ ⬛️ ⬜️",
       "⬜️ ⬜️ ⬛️ ⬜️ ⬜️" ,
       "⬜️ ⬛️ ⬜️ ⬛️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️"),

    6: ("⬜️ ⬜️ ⬜️ ⬜️ ⬜️",
       "⬜️ ⬛️ ⬜️ ⬛️ ⬜️",
       "⬜️ ⬛️ ⬜️ ⬛️ ⬜️" ,
       "⬜️ ⬛️ ⬜️ ⬛️ ⬜️",
       "⬜️ ⬜️ ⬜️ ⬜️ ⬜️"),


}

dice = []
total = 0
dice_num = 0

num_of_dice = int(input("How many dice?: "))

for num in range(num_of_dice):
    dice.append(random.randint(1,6))


for line in range(5):
    for die in dice:
        print(die_art.get(die)[line], end="   ")
    print()

for die in dice:
    total += die

print()
print("------------------------------------------------------------------")
print(total)

